"""
모든 사원들은 각자 !
출근 하시면 !!!!!~
아침 업무로 
배달 온 상자 안에 물건을 전부 까서
사과는 냉장실에 
아이스크림은 냉동실에 넣어 주시고,
나머지는 폐기처분 바람
그러고나서 아침업무를 체크하세요
"""

class 업무():
    아침업무유무 = False

    # 아침업무유무를 True로 바꿔주는 함수
    def 아침업무체크(self):
        self.아침업무유무 = True

    def 아침업무 (self, 상자):
        for 물건 in 상자:
            if 물건 == "사과":
                print(f"'{물건}' 냉장실에 넣기")
            elif 물건 == "아이스크림":
                print(f"'{물건}' 냉동실에 넣기")
            else :
                print(f"'{물건}' 폐기처분")
                # 아침업무 함수가 끝나면 아침업무체크 함수 실행
                self.아침업무체크()
        
# 출근 = False : 실행 X
출근 = True

if 출근:
    상자 = [ "콩", "콩", "콩", "사과"]

    # 아침업무를 하기 전
    twowix_업무 = 업무()
    print(twowix_업무.아침업무유무)
    # 아침업무를 한 후
    twowix_업무.아침업무(상자)
    print(twowix_업무.아침업무유무)

    베어유_어부 = 업무()
    print(베어유_어부.아침업무유무)